%层次分析法的权重

clear;clc;
A=[1 2 1/2 4;1/2 1 1/3 3;2 3 1 5;1/4 1/3 1/5 1];
[m,n]=size(A);
[V,D]=eig(A);  %求得A的特征值特征向量
%列归一化
B=zeros(m,n);
for i=1:n %列
    tmp=sum(A(:,n));
    for j=1:m  
B(j,i)=A(j,i)/tmp;
    end
end
%行求和
C=zeros(m,1);
for i=1:m
C(i,1)=sum(B(i,:));
end

%对C归一化
tmp=sum(sum(C));
for i=1:m
C(i,1)=C(i,1)/tmp;
end   

C=C';
S=[0.75 0.25];
SS=[0.460947503201024,0.326504481434059,0.137644046094750,0.0749039692701665;0.298606502986065,0.192435301924353,0.437956204379562,0.0710019907100199];
SSS=S*SS;